; domain
; Title: FlowFree Domain for Edgy Strategy (made compatible with Fast Downward planners)
; Author: Aditi Basu (University of Melbourne)

(define (domain FlowFree)
    (:requirements :strips :typing :action-costs :conditional-effects)

    (:types
        dot node
    )

    (:predicates
        ; pre-strategy domain predicates
        (head ?n - node ?d - dot)
        (selected ?d - dot)
        (finished ?d - dot)
        (adjacent ?n - node ?n - node)
        (filled ?n - node ?d - dot)

        ; Planimation predicates
        (position ?n - node)
        
        ; Edgy strategy predicates
        (nextToEdge ?n - node)               ; is a node next to an edge?
        (currentPath ?n - node)        ; is a node part of the current path being formed?

        ; Fast-Downward predicates
        (pipe ?n - node)                  ; does a node contain a pipe?

    )

    ; cost function
    (:functions
        (total-cost) - number
    )

    ; move selection from d1 to d2 based on cost
    (:action select-colour
        :parameters     (?d1 - dot
                         ?d2 - dot)

        :precondition   (and 
                            (selected ?d1)
                            (not (selected ?d2))
                            (not (finished ?d2))
                        )

        :effect         (and 
                            (selected ?d2)
                            (not (selected ?d1))
                            (finished ?d1)              
				            
                            (increase (total-cost) 1)
                        )
    )
    
    ; move from n1 to n2 where n2 is NOT nextToEdge
    (:action move
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (not (nextToEdge ?n2))
                        )
                        
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                             
                            ; increment cost as ?n2 is not nextToEdge
                            (increase (total-cost) 1)
                        )
    )
    
     ; move from n1 to n2 where n2 is nextToEdge
    (:action moveNextToEdge
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (nextToEdge ?n2)
                        )
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                            
                            ; no cost increase as ?n2 is nextToEdge
                            (increase (total-cost) 0)
                        )
    )

    ; finish a path by connecting to second dot 
    (:action finishPath
        :parameters     (?n1 - node
                         ?n2 - node
                         ?d - dot)

        :precondition   (and
                            (filled ?n2 ?d) 
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                        ) 

        :effect         (and 
                            (head ?n2 ?d)
                            
                            ; convert nodes adjacent to currentPath nodes to nextToEdge
                            (forall (?cp - node ?n - node) 
                                (when 
                                    (and (currentPath ?cp) (adjacent ?cp ?n))
                                    (nextToEdge ?n)    
                                )
                            )

                            ; reset all currentPath predicates to false 
                            (forall (?x - node)
                                (when 
                                    (currentPath ?x) 
                                    (not (currentPath ?x))
                                )
                            )

                            ; no cost increase as all dots will need to execute this action regardless of initial state
                            (increase (total-cost) 0)
                        )
    )
)

; problem
; Title: FlowFree Problem1-6x6 (Edgy Strategy)
; Author: Aditi Basu

(define (problem FlowFree-6x6)
    (:domain FlowFree)
    (:objects 
        r y g b o dummy - dot
        node1-6 node2-6 node3-6 node4-6 node5-6 node6-6 - node
        node1-5 node2-5 node3-5 node4-5 node5-5 node6-5 - node
        node1-4 node2-4 node3-4 node4-4 node5-4 node6-4 - node
        node1-3 node2-3 node3-3 node4-3 node5-3 node6-3 - node
        node1-2 node2-2 node3-2 node4-2 node5-2 node6-2 - node
        node1-1 node2-1 node3-1 node4-1 node5-1 node6-1 - node
    )

    (:init
        ; head relations
        (head node6-6 o)
        (head node2-4 y) (head node3-4 r)
        (head node2-2 g) 
        (head node4-1 b)

        ; filled relations
        ; the 'starting' positions
        (filled node6-6 o)
        (filled node2-4 y) (filled node3-4 r)
        (filled node2-2 g) 
        (filled node4-1 b)
        ; the 'destinations'
        (filled node4-3 g) (filled node6-3 y)
        (filled node4-2 o) (filled node5-2 r) (filled node6-2 b)

        ; nextToEdge relations - outermost cells
        (nextToEdge node1-1) (nextToEdge node1-2) (nextToEdge node1-3) (nextToEdge node1-4) (nextToEdge node1-5) (nextToEdge node1-6)
        (nextToEdge node2-1)                                                                                     (nextToEdge node2-6)
        (nextToEdge node3-1)                                                                                     (nextToEdge node3-6)
        (nextToEdge node4-1)                                                                                     (nextToEdge node4-6)
        (nextToEdge node5-1)                                                                                     (nextToEdge node5-6)
        (nextToEdge node6-1) (nextToEdge node6-2) (nextToEdge node6-3) (nextToEdge node6-4) (nextToEdge node6-5) (nextToEdge node6-6)
        
        ; specify initial value of functions
        (= (total-cost) 0)

        ; select dummy dot
        (selected dummy)

        ; pipe relations
        (pipe node6-6)
        (pipe node2-4) (pipe node3-4)
        (pipe node2-2) 
        (pipe node4-1)
        (pipe node4-3) (pipe node6-3)
        (pipe node4-2) (pipe node5-2) (pipe node6-2)

        ; adjacent relations
        (adjacent node1-1 node1-2) (adjacent node1-1 node2-1)
        (adjacent node1-2 node1-1) (adjacent node1-2 node2-2) (adjacent node1-2 node1-3)
        (adjacent node1-3 node1-2) (adjacent node1-3 node2-3) (adjacent node1-3 node1-4)
        (adjacent node1-4 node1-3) (adjacent node1-4 node2-4) (adjacent node1-4 node1-5)
        (adjacent node1-5 node1-4) (adjacent node1-5 node2-5) (adjacent node1-5 node1-6)
        (adjacent node1-6 node1-5) (adjacent node1-6 node2-6)

        (adjacent node2-1 node1-1) (adjacent node2-1 node3-1) (adjacent node2-1 node2-2)
        (adjacent node2-2 node2-1) (adjacent node2-2 node2-3) (adjacent node2-2 node1-2) (adjacent node2-2 node3-2)
        (adjacent node2-3 node2-2) (adjacent node2-3 node2-4) (adjacent node2-3 node1-3) (adjacent node2-3 node3-3)
        (adjacent node2-4 node2-3) (adjacent node2-4 node2-5) (adjacent node2-4 node1-4) (adjacent node2-4 node3-4)
        (adjacent node2-5 node1-5) (adjacent node2-5 node3-5) (adjacent node2-5 node2-4) (adjacent node2-5 node2-6)
        (adjacent node2-6 node1-6) (adjacent node2-6 node3-6) (adjacent node2-6 node2-5)

        (adjacent node3-1 node2-1) (adjacent node3-1 node4-1) (adjacent node3-1 node3-2)
        (adjacent node3-2 node3-1) (adjacent node3-2 node3-3) (adjacent node3-2 node2-2) (adjacent node3-2 node4-2)
        (adjacent node3-3 node3-2) (adjacent node3-3 node3-4) (adjacent node3-3 node2-3) (adjacent node3-3 node4-3)
        (adjacent node3-4 node3-3) (adjacent node3-4 node3-5) (adjacent node3-4 node2-4) (adjacent node3-4 node4-4)
        (adjacent node3-5 node2-5) (adjacent node3-5 node4-5) (adjacent node3-5 node3-4) (adjacent node3-5 node3-6)
        (adjacent node3-6 node2-6) (adjacent node3-6 node4-6) (adjacent node3-6 node3-5)

        (adjacent node4-1 node3-1) (adjacent node4-1 node5-1) (adjacent node4-1 node4-2)
        (adjacent node4-2 node4-1) (adjacent node4-2 node4-3) (adjacent node4-2 node3-2) (adjacent node4-2 node5-2)
        (adjacent node4-3 node4-2) (adjacent node4-3 node4-4) (adjacent node4-3 node3-3) (adjacent node4-3 node5-3)
        (adjacent node4-4 node4-3) (adjacent node4-4 node4-5) (adjacent node4-4 node3-4) (adjacent node4-4 node5-4)
        (adjacent node4-5 node3-5) (adjacent node4-5 node5-5) (adjacent node4-5 node4-4) (adjacent node4-5 node4-6)
        (adjacent node4-6 node3-6) (adjacent node4-6 node5-6) (adjacent node4-6 node4-5)

        (adjacent node5-1 node4-1) (adjacent node5-1 node6-1) (adjacent node5-1 node5-2)
        (adjacent node5-2 node5-1) (adjacent node5-2 node5-3) (adjacent node5-2 node4-2) (adjacent node5-2 node6-2)
        (adjacent node5-3 node5-2) (adjacent node5-3 node5-4) (adjacent node5-3 node4-3) (adjacent node5-3 node6-3)
        (adjacent node5-4 node5-3) (adjacent node5-4 node5-5) (adjacent node5-4 node4-4) (adjacent node5-4 node6-4)
        (adjacent node5-5 node4-5) (adjacent node5-5 node6-5) (adjacent node5-5 node5-4) (adjacent node5-5 node5-6)
        (adjacent node5-6 node4-6) (adjacent node5-6 node6-6) (adjacent node5-6 node5-5)

        (adjacent node6-1 node6-2) (adjacent node6-1 node5-1) 
        (adjacent node6-2 node6-1) (adjacent node6-2 node5-2) (adjacent node6-2 node6-3)
        (adjacent node6-3 node6-2) (adjacent node6-3 node5-3) (adjacent node6-3 node6-4)
        (adjacent node6-4 node6-3) (adjacent node6-4 node5-4) (adjacent node6-4 node6-5)
        (adjacent node6-5 node6-4) (adjacent node6-5 node5-5) (adjacent node6-5 node6-6)
        (adjacent node6-6 node6-5) (adjacent node6-6 node5-6)

        ; position relations
        (position node1-1) (position node1-2) (position node1-3) (position node1-4) (position node1-5) (position node1-6)
        (position node2-1) (position node2-2) (position node2-3) (position node2-4) (position node2-5) (position node2-6)
        (position node3-1) (position node3-2) (position node3-3) (position node3-4) (position node3-5) (position node3-6)
        (position node4-1) (position node4-2) (position node4-3) (position node4-4) (position node4-5) (position node4-6)
        (position node5-1) (position node5-2) (position node5-3) (position node5-4) (position node5-5) (position node5-6)
        (position node6-1) (position node6-2) (position node6-3) (position node6-4) (position node6-5) (position node6-6)

    )

    (:goal (and
        ;head relations
        (head node4-3 g) (head node6-3 y)
        (head node4-2 o) (head node5-2 r) (head node6-2 b)
        
        ; pipe relations
        (pipe node1-6) (pipe node2-6) (pipe node3-6) (pipe node4-6) (pipe node5-6)
        (pipe node1-5) (pipe node2-5) (pipe node3-5) (pipe node4-5) (pipe node5-5) (pipe node6-5)
        (pipe node1-4) (pipe node4-4) (pipe node5-4) (pipe node6-4)
        (pipe node1-3) (pipe node2-3) (pipe node3-3) (pipe node5-3)
        (pipe node1-2) (pipe node3-2)
        (pipe node1-1) (pipe node2-1) (pipe node3-1) (pipe node5-1) (pipe node6-1)
        )
    )

    (:metric 
        minimize (total-cost)
    )

)

; plan
1. (select-colour dummy b)
   deleted: (selected dummy)
   added: (selected b) (finished dummy)
   goals met: 0 of 31
2. (movenexttoedge node4-1 node5-1 b)
   added: (head node5-1 b) (pipe node5-1) (currentpath node5-1)
   goals met: 1 of 31
3. (movenexttoedge node5-1 node6-1 b)
   added: (head node6-1 b) (pipe node6-1) (currentpath node6-1)
   goals met: 2 of 31
4. (finishpath node6-1 node6-2 b)
   deleted: (currentpath node5-1) (currentpath node6-1)
   added: (head node6-2 b) (nexttoedge node5-2)
   goals met: 3 of 31
5. (select-colour b o)
   deleted: (selected b)
   added: (selected o) (finished b)
   goals met: 3 of 31
6. (movenexttoedge node6-6 node5-6 o)
   added: (head node5-6 o) (pipe node5-6) (currentpath node5-6)
   goals met: 4 of 31
7. (movenexttoedge node5-6 node4-6 o)
   added: (head node4-6 o) (pipe node4-6) (currentpath node4-6)
   goals met: 5 of 31
8. (movenexttoedge node4-6 node3-6 o)
   added: (head node3-6 o) (pipe node3-6) (currentpath node3-6)
   goals met: 6 of 31
9. (movenexttoedge node3-6 node2-6 o)
   added: (head node2-6 o) (pipe node2-6) (currentpath node2-6)
   goals met: 7 of 31
10. (movenexttoedge node2-6 node1-6 o)
   added: (head node1-6 o) (pipe node1-6) (currentpath node1-6)
   goals met: 8 of 31
11. (movenexttoedge node1-6 node1-5 o)
   added: (head node1-5 o) (pipe node1-5) (currentpath node1-5)
   goals met: 9 of 31
12. (movenexttoedge node1-5 node1-4 o)
   added: (head node1-4 o) (pipe node1-4) (currentpath node1-4)
   goals met: 10 of 31
13. (movenexttoedge node1-4 node1-3 o)
   added: (head node1-3 o) (pipe node1-3) (currentpath node1-3)
   goals met: 11 of 31
14. (movenexttoedge node1-3 node1-2 o)
   added: (head node1-2 o) (pipe node1-2) (currentpath node1-2)
   goals met: 12 of 31
15. (movenexttoedge node1-2 node1-1 o)
   added: (head node1-1 o) (pipe node1-1) (currentpath node1-1)
   goals met: 13 of 31
16. (movenexttoedge node1-1 node2-1 o)
   added: (head node2-1 o) (pipe node2-1) (currentpath node2-1)
   goals met: 14 of 31
17. (movenexttoedge node2-1 node3-1 o)
   added: (head node3-1 o) (pipe node3-1) (currentpath node3-1)
   goals met: 15 of 31
18. (move node3-1 node3-2 o)
   added: (head node3-2 o) (pipe node3-2) (currentpath node3-2)
   goals met: 16 of 31
19. (finishpath node3-2 node4-2 o)
   deleted: (currentpath node1-6) (currentpath node2-6) (currentpath node3-6) (currentpath node4-6) (currentpath node5-6) (currentpath node1-5) (currentpath node1-4) (currentpath node1-3) (currentpath node1-2) (currentpath node3-2) (currentpath node1-1) (currentpath node2-1) (currentpath node3-1)
   added: (head node4-2 o) (nexttoedge node2-5) (nexttoedge node3-5) (nexttoedge node4-5) (nexttoedge node5-5) (nexttoedge node2-4) (nexttoedge node2-3) (nexttoedge node2-2) (nexttoedge node3-3) (nexttoedge node4-2) (nexttoedge node3-2)
   goals met: 17 of 31
20. (select-colour o y)
   deleted: (selected o)
   added: (selected y) (finished o)
   goals met: 17 of 31
21. (movenexttoedge node2-4 node2-5 y)
   added: (head node2-5 y) (pipe node2-5) (currentpath node2-5)
   goals met: 18 of 31
22. (movenexttoedge node2-5 node3-5 y)
   added: (head node3-5 y) (pipe node3-5) (currentpath node3-5)
   goals met: 19 of 31
23. (movenexttoedge node3-5 node4-5 y)
   added: (head node4-5 y) (pipe node4-5) (currentpath node4-5)
   goals met: 20 of 31
24. (movenexttoedge node4-5 node5-5 y)
   added: (head node5-5 y) (pipe node5-5) (currentpath node5-5)
   goals met: 21 of 31
25. (movenexttoedge node5-5 node6-5 y)
   added: (head node6-5 y) (pipe node6-5) (currentpath node6-5)
   goals met: 22 of 31
26. (movenexttoedge node6-5 node6-4 y)
   added: (head node6-4 y) (pipe node6-4) (currentpath node6-4)
   goals met: 23 of 31
27. (finishpath node6-4 node6-3 y)
   deleted: (currentpath node2-5) (currentpath node3-5) (currentpath node4-5) (currentpath node5-5) (currentpath node6-5) (currentpath node6-4)
   added: (head node6-3 y) (nexttoedge node3-4) (nexttoedge node4-4) (nexttoedge node5-4)
   goals met: 24 of 31
28. (select-colour y r)
   deleted: (selected y)
   added: (selected r) (finished y)
   goals met: 24 of 31
29. (movenexttoedge node3-4 node4-4 r)
   added: (head node4-4 r) (pipe node4-4) (currentpath node4-4)
   goals met: 25 of 31
30. (movenexttoedge node4-4 node5-4 r)
   added: (head node5-4 r) (pipe node5-4) (currentpath node5-4)
   goals met: 26 of 31
31. (move node5-4 node5-3 r)
   added: (head node5-3 r) (pipe node5-3) (currentpath node5-3)
   goals met: 27 of 31
32. (finishpath node5-3 node5-2 r)
   deleted: (currentpath node4-4) (currentpath node5-4) (currentpath node5-3)
   added: (head node5-2 r) (nexttoedge node4-3) (nexttoedge node5-3)
   goals met: 28 of 31
33. (select-colour r g)
   deleted: (selected r)
   added: (selected g) (finished r)
   goals met: 28 of 31
34. (movenexttoedge node2-2 node2-3 g)
   added: (head node2-3 g) (pipe node2-3) (currentpath node2-3)
   goals met: 29 of 31
35. (movenexttoedge node2-3 node3-3 g)
   added: (head node3-3 g) (pipe node3-3) (currentpath node3-3)
   goals met: 30 of 31
36. (finishpath node3-3 node4-3 g)
   deleted: (currentpath node2-3) (currentpath node3-3)
   added: (head node4-3 g)
   goals met: 31 of 31
